import datetime
p_v=input("Вы хотите увидеть время текущее или произвести ввод? формат ввода: текущее\произвести ввод\n")
p_v.lower
if p_v=="1":
    p_v=datetime.datetime.now()
    m, h=p_v.minute, p_v.hour
    print(h, m)#удалить
elif p_v=="2":
    p_v=input("введите время в формате hh.mm\n")
    p_v=p_v.replace(" ",".").replace(":",".").replace(";",".").replace(",",".").replace("/",".")
    if len(p_v)!=5 or p_v[2]!=".":
        print("Вы ввели не верный формат данных")
        exit()
    h_m=p_v.split(".")
    h=h_m[0]
    m=h_m[1]
    if not h.isnumeric or not m.isnumeric:
        print("Вы ввели данные не верно")
        exit()
    h=int(h)
    m=int(m)
    if h>24 or  h<0:
        print("Вы ввели не существующие часовое время")
        exit()
    if m>60 or m<0:
        print("Вы ввели не существующие минутное время")
        exit()
    if h==0 and m==0:
        print("Полночь")
        exit()
    print(h,m)#удалить
else:
    print("Вы ввели данные не в указанном формате")
key_time={1:"один",2:"два",3:"три",4:"четыре",5:"пять",6:"шесть",7:"семь",8:"восемь",9:"девять",10:"десять",
11:"одинадцать",12:"двенадцать",13:"тринадцать",14:"четырнадцать",15:"пятнадцать",16:"шестнадцать",17:"семнадцать",
18:"восемнадцать",19:"девятнадцать",20:"двадцать",30:"тридцать", 0:""}
h_time={1:"первого", 2:"второго",3:"третьего",4:"четвертого",7:"седьмого",8:"восьмого"}
h_h=h
m_m=m
h=key_time[h]
m=key_time[m]
if m_m==0:
    print(f"{h} часов ровно")
elif m_m==30:
    if h_h>12:
        h_h=h_h+1-12  
        print(f"половина {h_h[:-1]}ого")
    else:
        h_h=h_h+1
        h_h=key_time[h_h]
        print(f"половина {h_h[:-1]}ого")
else:
    print("Заебавшая рожа")










